backend/app/models/user.rb

SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Demo-lition"], ["LIMIT", 1]]
---
  def self.find_by_credentials(u, p)
    user = self.find_by(username: u) || self.find_by(email: u)